In [1]:
# NIM/Nama: 16520289/Gagas Praharsa Bahar
# Tanggal: 13 Desember 2020
# Deskripsi: Problem 2

In [2]:
#Import modules
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
#Dataframe init
df = pd.read_csv("nilai_uas.csv")

In [4]:
#Checking
df.head()

                  nama fakultas  nilai_kal  nilai_fis  nilai_kim
0         Raihan Daris       SF      60.27      65.59      51.70
1           Galuh Wina     STEI      52.99      55.25      66.31
2         Johannes Sun    FMIPA      51.20      51.30      84.70
3  Abdurrahman WIlliam     FTSL      31.17      36.88      50.25
4         Rayhan Faris     STEI      55.55      57.61      67.46

In [5]:
#Searching for Tuan Mor
df.loc[df["nama"] == "Tuan Mor"]

         nama fakultas  nilai_kal  nilai_fis  nilai_kim
391  Tuan Mor     STEI      94.76       67.5      24.82

In [6]:
# Diatas adalah data nilai dari Tuan Mor.

In [7]:
maximum = df.max()
df.loc[df["nilai_fis"] == maximum["nilai_fis"]]

             nama fakultas  nilai_kal  nilai_fis  nilai_kim
250  Cahyani Mora     FSRD      100.0      100.0      79.55

In [8]:
# Diatas adalah nilai fisika tertinggi.

In [9]:
dfsorted = df.sort_values(["nilai_kim"], ascending=[0])
dfsorted[:10]

                  nama fakultas  nilai_kal  nilai_fis  nilai_kim
3074  Muhammadi Jumhur     FTSL      35.56      39.49      88.38
640         Grace Yoga     FTTM      42.24      48.16      86.26
18      Maria Manurung     FTMD      56.86      58.83      86.26
3469        Dhiya Wafa      SBM      68.89      76.51      85.73
661          Rasyid FH     FSRD      77.78      77.89      85.26
1884       Sukma Ulhaq     FITB      43.97      44.91      85.26
780       Rizam Rayhan     FSRD      72.15      71.38      85.07
283   WIJAYANTI Amadio    SITHS      61.96      57.73      85.07
3017     Jevon Tangguh    FMIPA      50.42      48.15      84.92
2487       Ediva zilva    SITHR      65.04      69.31      84.87

In [10]:
# Diatas adalah 10 nilai kimia tertinggi.

In [11]:
df[df["nilai_kal"] < 50]["nilai_kal"].count()

1549

In [12]:
# Banyaknya nilai kalkulus di bawah 50 adalah 1549.

In [13]:
df[df["fakultas"] == "FMIPA"]["fakultas"].count()

396

In [14]:
# Banyaknya mahasiswa FMIPA sebanyak 396 orang.